wrk2/misc_logs/home_60.log
Running 1m test @ http://localhost:8080/wrk2-api/home-timeline/read
  2 threads and 10 connections
  Thread calibration: mean lat.: 3.101ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.704ms, rate sampling interval: 12ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     5.89ms    5.71ms  23.22ms   80.22%
    Req/Sec    30.71     54.98   222.00     79.74%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.61ms
 75.000%    9.54ms
 90.000%   15.01ms
 99.000%   23.22ms
 99.900%   31.92ms
 99.990%   41.18ms
 99.999%   41.18ms
100.000%   41.18ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.129     0.000000            1         1.00
       1.779     0.100000          295         1.11
       1.960     0.200000          589         1.25
       2.107     0.300000          884         1.43
       2.257     0.400000         1179         1.67
       2.605     0.500000         1471         2.00
       2.997     0.550000         1619         2.22
       3.573     0.600000         1766         2.50
       4.503     0.650000         1913         2.86
       6.735     0.700000         2060         3.33
       9.543     0.750000         2207         4.00
      10.631     0.775000         2281         4.44
      11.543     0.800000         2354         5.00
      12.255     0.825000         2428         5.71
      12.959     0.850000         2502         6.67
      13.863     0.875000         2576         8.00
      14.431     0.887500         2612         8.89
      15.007     0.900000         2650        10.00
      15.391     0.912500         2686        11.43
      15.935     0.925000         2722        13.33
      16.575     0.937500         2759        16.00
      16.847     0.943750         2777        17.78
      17.295     0.950000         2795        20.00
      17.839     0.956250         2814        22.86
      18.399     0.962500         2832        26.67
      18.911     0.968750         2851        32.00
      19.263     0.971875         2860        35.56
      19.759     0.975000         2869        40.00
      20.143     0.978125         2878        45.71
      20.527     0.981250         2887        53.33
      21.295     0.984375         2897        64.00
      21.535     0.985938         2901        71.11
      22.095     0.987500         2906        80.00
      22.575     0.989062         2910        91.43
      23.487     0.990625         2915       106.67
      25.119     0.992188         2920       128.00
      25.231     0.992969         2922       142.22
      25.519     0.993750         2924       160.00
      26.271     0.994531         2928       182.86
      26.431     0.995313         2929       213.33
      27.055     0.996094         2931       256.00
      27.343     0.996484         2932       284.44
      27.471     0.996875         2933       320.00
      27.727     0.997266         2934       365.71
      28.799     0.997656         2936       426.67
      29.759     0.998047         2937       512.00
      29.759     0.998242         2937       568.89
      30.047     0.998437         2938       640.00
      30.047     0.998633         2938       731.43
      31.919     0.998828         2939       853.33
      36.191     0.999023         2940      1024.00
      36.191     0.999121         2940      1137.78
      36.191     0.999219         2940      1280.00
      36.191     0.999316         2940      1462.86
      37.471     0.999414         2941      1706.67
      37.471     0.999512         2941      2048.00
      37.471     0.999561         2941      2275.56
      37.471     0.999609         2941      2560.00
      37.471     0.999658         2941      2925.71
      41.183     0.999707         2942      3413.33
      41.183     1.000000         2942          inf
#[Mean    =        5.885, StdDeviation   =        5.713]
#[Max     =       41.152, Total count    =         2942]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3594 requests in 1.00m, 11.36MB read
Requests/sec:     59.89
Transfer/sec:    193.90KB