wrk2/misc_logs/user_20.log
Running 1m test @ http://localhost:8080/wrk2-api/user-timeline/read
  2 threads and 10 connections
  Thread calibration: mean lat.: 4.013ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.148ms, rate sampling interval: 13ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     4.02ms    1.92ms  12.00ms   89.21%
    Req/Sec    10.53     29.05    90.00     87.81%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.43ms
 75.000%    4.30ms
 90.000%    5.95ms
 99.000%   12.00ms
 99.900%   25.10ms
 99.990%   26.59ms
 99.999%   26.59ms
100.000%   26.59ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.887     0.000000            1         1.00
       2.737     0.100000          102         1.11
       2.969     0.200000          204         1.25
       3.123     0.300000          306         1.43
       3.281     0.400000          408         1.67
       3.433     0.500000          510         2.00
       3.539     0.550000          561         2.22
       3.667     0.600000          612         2.50
       3.833     0.650000          663         2.86
       4.011     0.700000          714         3.33
       4.315     0.750000          765         4.00
       4.479     0.775000          790         4.44
       4.659     0.800000          816         5.00
       4.955     0.825000          841         5.71
       5.203     0.850000          867         6.67
       5.495     0.875000          892         8.00
       5.763     0.887500          905         8.89
       5.963     0.900000          918        10.00
       6.123     0.912500          930        11.43
       6.419     0.925000          943        13.33
       6.879     0.937500          956        16.00
       7.063     0.943750          963        17.78
       7.379     0.950000          969        20.00
       7.675     0.956250          975        22.86
       8.043     0.962500          981        26.67
       8.807     0.968750          988        32.00
       8.999     0.971875          991        35.56
       9.079     0.975000          994        40.00
       9.239     0.978125          997        45.71
       9.367     0.981250         1000        53.33
       9.871     0.984375         1004        64.00
       9.975     0.985938         1005        71.11
      10.335     0.987500         1007        80.00
      10.919     0.989062         1008        91.43
      12.199     0.990625         1010       106.67
      12.383     0.992188         1012       128.00
      12.383     0.992969         1012       142.22
      13.247     0.993750         1013       160.00
      13.303     0.994531         1014       182.86
      13.807     0.995313         1015       213.33
      14.479     0.996094         1016       256.00
      14.479     0.996484         1016       284.44
      14.479     0.996875         1016       320.00
      15.303     0.997266         1017       365.71
      15.303     0.997656         1017       426.67
      25.103     0.998047         1018       512.00
      25.103     0.998242         1018       568.89
      25.103     0.998437         1018       640.00
      25.103     0.998633         1018       731.43
      25.103     0.998828         1018       853.33
      26.591     0.999023         1019      1024.00
      26.591     1.000000         1019          inf
#[Mean    =        4.025, StdDeviation   =        1.923]
#[Max     =       26.576, Total count    =         1019]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1227 requests in 1.00m, 240.67KB read
  Socket errors: connect 0, read 0, write 0, timeout 6
Requests/sec:     20.45
Transfer/sec:      4.01KB