wrk2/misc_logs/user_40.log
Running 5m test @ http://usec-var-7:8080/wrk2-api/user-timeline/read
  4 threads and 8 connections
  Thread calibration: mean lat.: 22.374ms, rate sampling interval: 69ms
  Thread calibration: mean lat.: 23.139ms, rate sampling interval: 71ms
  Thread calibration: mean lat.: 21.207ms, rate sampling interval: 57ms
  Thread calibration: mean lat.: 22.593ms, rate sampling interval: 64ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    19.74ms    7.49ms  45.95ms   78.01%
    Req/Sec     9.75     12.29    47.00     86.66%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   18.25ms
 75.000%   22.74ms
 90.000%   29.17ms
 99.000%   45.95ms
 99.900%   60.03ms
 99.990%   69.82ms
 99.999%   75.20ms
100.000%   75.20ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       4.231     0.000000            1         1.00
      12.591     0.100000         1154         1.11
      14.407     0.200000         2305         1.25
      15.695     0.300000         3451         1.43
      16.927     0.400000         4614         1.67
      18.255     0.500000         5755         2.00
      18.943     0.550000         6326         2.22
      19.727     0.600000         6901         2.50
      20.575     0.650000         7478         2.86
      21.567     0.700000         8053         3.33
      22.735     0.750000         8623         4.00
      23.503     0.775000         8912         4.44
      24.351     0.800000         9200         5.00
      25.359     0.825000         9484         5.71
      26.383     0.850000         9770         6.67
      27.743     0.875000        10057         8.00
      28.431     0.887500        10202         8.89
      29.167     0.900000        10344        10.00
      30.015     0.912500        10488        11.43
      31.023     0.925000        10633        13.33
      32.367     0.937500        10776        16.00
      33.151     0.943750        10851        17.78
      33.983     0.950000        10920        20.00
      34.847     0.956250        10991        22.86
      36.159     0.962500        11063        26.67
      37.215     0.968750        11136        32.00
      37.887     0.971875        11170        35.56
      38.943     0.975000        11207        40.00
      40.127     0.978125        11242        45.71
      41.119     0.981250        11278        53.33
      42.783     0.984375        11314        64.00
      43.551     0.985938        11332        71.11
      44.639     0.987500        11350        80.00
      45.471     0.989062        11370        91.43
      46.623     0.990625        11386       106.67
      47.551     0.992188        11404       128.00
      48.031     0.992969        11413       142.22
      48.959     0.993750        11422       160.00
      49.599     0.994531        11432       182.86
      50.751     0.995313        11440       213.33
      52.031     0.996094        11449       256.00
      52.927     0.996484        11453       284.44
      53.759     0.996875        11458       320.00
      54.399     0.997266        11462       365.71
      55.551     0.997656        11467       426.67
      57.311     0.998047        11471       512.00
      57.599     0.998242        11473       568.89
      58.527     0.998437        11476       640.00
      58.719     0.998633        11478       731.43
      59.263     0.998828        11480       853.33
      60.031     0.999023        11482      1024.00
      61.023     0.999121        11483      1137.78
      62.623     0.999219        11485      1280.00
      62.943     0.999316        11486      1462.86
      63.519     0.999414        11487      1706.67
      65.919     0.999512        11488      2048.00
      65.919     0.999561        11488      2275.56
      66.815     0.999609        11489      2560.00
      67.967     0.999658        11490      2925.71
      67.967     0.999707        11490      3413.33
      68.159     0.999756        11491      4096.00
      68.159     0.999780        11491      4551.11
      68.159     0.999805        11491      5120.00
      69.823     0.999829        11492      5851.43
      69.823     0.999854        11492      6826.67
      69.823     0.999878        11492      8192.00
      69.823     0.999890        11492      9102.22
      69.823     0.999902        11492     10240.00
      75.199     0.999915        11493     11702.86
      75.199     1.000000        11493          inf
#[Mean    =       19.739, StdDeviation   =        7.487]
#[Max     =       75.136, Total count    =        11493]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  11919 requests in 5.00m, 154.82MB read
Requests/sec:     39.73
Transfer/sec:    528.40KB